solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpi2c_cmsis.c
#endif /* LPI2C11 */

#if defined(LPI2C12) && defined(RTE_I2C12) && RTE_I2C12
/* User needs to provide the implementation for LPI2C12_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPI2C12_GetFreq(void);

static cmsis_lpi2c_resource_t LPI2C12_Resource = {LPI2C12, LPI2C12_GetFreq};

#if defined(RTE_I2C12_DMA_EN) && RTE_I2C12_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpi2c_edma_resource_t LPI2C12_EdmaResource = {
    RTE_I2C12_DMA_TX_DMA_BASE,    RTE_I2C12_DMA_TX_CH,          (uint16_t)RTE_I2C12_DMA_TX_PERI_SEL,
    RTE_I2C12_DMA_RX_DMA_BASE,    RTE_I2C12_DMA_RX_CH,          (uint16_t)RTE_I2C12_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_I2C12_DMA_TX_DMAMUX_BASE, RTE_I2C12_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static lpi2c_master_edma_handle_t LPI2C12_EdmaHandle);
static edma_handle_t LPI2C12_EdmaTxHandle;
static edma_handle_t LPI2C12_EdmaRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpi2c12_edma_driver_state")
static cmsis_lpi2c_edma_driver_state_t LPI2C12_EdmaDriverState = {
#else
static cmsis_lpi2c_edma_driver_state_t LPI2C12_EdmaDriverState = {
#endif
    &LPI2C12_Resource, &LPI2C12_EdmaResource, &LPI2C12_EdmaHandle, &LPI2C12_EdmaTxHandle, &LPI2C12_EdmaRxHandle,
};

static int32_t LPI2C12_Master_EdmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
#ifdef RTE_I2C12_PIN_INIT
    RTE_I2C12_PIN_INIT();
#endif
    return LPI2C_Master_EdmaInitialize(cb_event, &LPI2C12_EdmaDriverState);
}

static int32_t LPI2C12_Master_EdmaUninitialize(void)
{
#ifdef RTE_I2C12_PIN_DEINIT
    RTE_I2C12_PIN_DEINIT();
#endif
    return LPI2C_Master_EdmaUninitialize(&LPI2C12_EdmaDriverState);
}

static int32_t LPI2C12_Master_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPI2C_Master_EdmaPowerControl(state, &LPI2C12_EdmaDriverState);
}

static int32_t LPI2C12_Master_EdmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_EdmaTransmit(addr, data, num, xfer_pending, &LPI2C12_EdmaDriverState);
}

static int32_t LPI2C12_Master_EdmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_EdmaReceive(addr, data, num, xfer_pending, &LPI2C12_EdmaDriverState);
}

static int32_t LPI2C12_Master_EdmaGetDataCount(void)
{
    return LPI2C_Master_EdmaGetDataCount(&LPI2C12_EdmaDriverState);
}

static int32_t LPI2C12_Master_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPI2C_Master_EdmaControl(control, arg, &LPI2C12_EdmaDriverState);
}

static ARM_I2C_STATUS LPI2C12_Master_EdmaGetStatus(void)
{
    return LPI2C_Master_EdmaGetStatus(&LPI2C12_EdmaDriverState);
}

#endif

#else

static cmsis_i2c_handle_t LPI2C12_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpi2c12_interrupt_driver_state")
static cmsis_lpi2c_interrupt_driver_state_t LPI2C12_InterruptDriverState = {
#else
static cmsis_lpi2c_interrupt_driver_state_t LPI2C12_InterruptDriverState = {
#endif
    &LPI2C12_Resource,
    &LPI2C12_Handle,
};

static void KSDK_LPI2C12_SLAVE_InterruptCallback(LPI2C_Type *base, lpi2c_slave_transfer_t *xfer, void *userData)
{
    KSDK_LPI2C_SLAVE_InterruptCallback(base, xfer, userData, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
#ifdef RTE_I2C12_PIN_INIT
    RTE_I2C12_PIN_INIT();
#endif
    return LPI2C_InterruptInitialize(cb_event, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_InterruptUninitialize(void)
{
#ifdef RTE_I2C12_PIN_DEINIT
    RTE_I2C12_PIN_DEINIT();
#endif
    return LPI2C_InterruptUninitialize(&LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPI2C_InterruptPowerControl(state, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_InterruptReceive(addr, data, num, xfer_pending, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    LPI2C12_InterruptDriverState.handle->slave_handle.callback = KSDK_LPI2C12_SLAVE_InterruptCallback;
    return LPI2C_Slave_InterruptTransmit(data, num, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    LPI2C12_InterruptDriverState.handle->slave_handle.callback = KSDK_LPI2C12_SLAVE_InterruptCallback;
    return LPI2C_Slave_InterruptReceive(data, num, &LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_InterruptGetDataCount(void)
{
    return LPI2C_InterruptGetDataCount(&LPI2C12_InterruptDriverState);
}

static int32_t LPI2C12_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPI2C_InterruptControl(control, arg, &LPI2C12_InterruptDriverState);
}

static ARM_I2C_STATUS LPI2C12_InterruptGetStatus(void)
{
    return LPI2C_InterruptGetStatus(&LPI2C12_InterruptDriverState);
}

#endif /* RTE_I2C12_DMA_EN */

ARM_DRIVER_I2C Driver_I2C12 = {LPI2Cx_GetVersion,
                               LPI2Cx_GetCapabilities,
#if defined(RTE_I2C12_DMA_EN) && RTE_I2C12_DMA_EN
                               LPI2C12_Master_EdmaInitialize,
                               LPI2C12_Master_EdmaUninitialize,
                               LPI2C12_Master_EdmaPowerControl,
                               LPI2C12_Master_EdmaTransmit,
                               LPI2C12_Master_EdmaReceive,
                               NULL,
                               NULL,
                               LPI2C12_Master_EdmaGetDataCount,
                               LPI2C12_Master_EdmaControl,
                               LPI2C12_Master_EdmaGetStatus
#else
                               LPI2C12_InterruptInitialize,
                               LPI2C12_InterruptUninitialize,
                               LPI2C12_InterruptPowerControl,
                               LPI2C12_Master_InterruptTransmit,
                               LPI2C12_Master_InterruptReceive,
                               LPI2C12_Slave_InterruptTransmit,
                               LPI2C12_Slave_InterruptReceive,
                               LPI2C12_InterruptGetDataCount,
                               LPI2C12_InterruptControl,
                               LPI2C12_InterruptGetStatus
#endif /* RTE_I2C12_DMA_EN */
};

#endif /* LPI2C12 */

#if defined(LPI2C13) && defined(RTE_I2C13) && RTE_I2C13
/* User needs to provide the implementation for LPI2C13_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPI2C13_GetFreq(void);

static cmsis_lpi2c_resource_t LPI2C13_Resource = {LPI2C13, LPI2C13_GetFreq};

#if defined(RTE_I2C13_DMA_EN) && RTE_I2C13_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpi2c_edma_resource_t LPI2C13_EdmaResource = {
    RTE_I2C13_DMA_TX_DMA_BASE,    RTE_I2C13_DMA_TX_CH,          (uint16_t)RTE_I2C13_DMA_TX_PERI_SEL,
    RTE_I2C13_DMA_RX_DMA_BASE,    RTE_I2C13_DMA_RX_CH,          (uint16_t)RTE_I2C13_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_I2C13_DMA_TX_DMAMUX_BASE, RTE_I2C13_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static lpi2c_master_edma_handle_t LPI2C13_EdmaHandle);
static edma_handle_t LPI2C13_EdmaTxHandle;
static edma_handle_t LPI2C13_EdmaRxHandle;

